# Introdução ao Pandas - Manipulação de Dados

Pandas é uma biblioteca preparada para trabalhar com dados. É possível: importar, exportar, manipular, etc.

* Dados tabulares
* DataFrame
* funções Aritméticas

## Documentação: [https://pandas.pydata.org/pandas-docs/stable/](https://pandas.pydata.org/pandas-docs/stable/)

# Estrutura de Dados - Tabulares

<span style="color: white;">
<img src="https://1.bp.blogspot.com/-Q7Z24Yg-_lk/YGelmEQAXQI/AAAAAAAABiI/AAJs1Az8vMkbxhg_dPdG5LdPfHsZR3SIQCPcBGAYYCw/s1046/02_io_readwrite.png"></span>

# Características dos dados tabulares

* Primeira linha: Cabeçalho (**Header**)
* Cada coluna: uma variável (**Variable**)
* Cada linha: uma observação (**Observation**)
* Cada tabela (arquivo): um nível de observação (**Level**)

* DataFrame: tabela retangular de dados
    * Conjunto de *Series*
    * Todas compartilhando do mesmo índice (*index*)

* Series: Coluna do DataFrame
    * *arrays* em 1-D
    * Composta por:
        * Sequência de valores
            * *numeric*
            * *string*
            * *bool*
        * Sequência de *index*

Representação gráfica de um DataFrame

![](https://media.geeksforgeeks.org/wp-content/uploads/20200225170506/pandas-series.png)

In [1]:
import pandas as pd # pd é um apelido ou "alias" para o pandas

In [3]:
# como carregar um arquivo do tipo CSV
# criar uma variável para receber o arquivo aberto (dados - dataset)
# quando carregamos um dataset para o Pandas, torna-se um DataFrame (df)
df_alunos = pd.read_csv('/content/alunos.csv', sep=',')

In [4]:
# mostrando os dados do DataFrame
df_alunos.head() # mostra as cinco primeiras linhas do DataFrame

    ra            nome        curso  nota1  nota2
0  123           Edson         TADS    6.5    7.5
1  321          Andrea         TGTI    8.5    6.2
2  159         Gustavo         PDPD    9.6    4.2
3  753           Elisa     Medicina    8.5    8.5
4  654  Lola Pessarelo  Veterinária    7.5    7.8

In [5]:
# mostrando linhas com filtro
df_alunos.head(2)

    ra    nome curso  nota1  nota2
0  123   Edson  TADS    6.5    7.5
1  321  Andrea  TGTI    8.5    6.2

In [9]:
# mas quantos registros tem no DataFrame?
df_alunos.shape

(5, 5)

In [10]:
# .shape sempre retornará dois valores, onde o primeiro é a quantidade de
# registros e a setunda a quantidade de colunas.
# podem ser acessadas via índice, como nas listas
print(df_alunos.shape[0]) # mostra a quantidade de registros
print(df_alunos.shape[1]) # mostra a quantidade de colunas

5
5

In [13]:
# mostrando dados estatísticos sobre o DataFrame
df_alunos.describe()

               ra     nota1     nota2
count    5.000000  5.000000  5.000000
mean   402.000000  8.120000  6.840000
std    287.296015  1.171324  1.694993
min    123.000000  6.500000  4.200000
25%    159.000000  7.500000  6.200000
50%    321.000000  8.500000  7.500000
75%    654.000000  8.500000  7.800000
max    753.000000  9.600000  8.500000

In [15]:
# até aqui "tá mamão com açúcar", mas de que tipos são os dados????
df_alunos.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   ra      5 non-null      int64
 1   nome    5 non-null      object
 2   curso   5 non-null      object
 3   nota1   5 non-null      float64
 4   nota2   5 non-null      float64
dtypes: float64(2), int64(1), object(2)
memory usage: 328.0+ bytes